src/main/resources/doReissuePreview_ReissueCiftSegment.text

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.iata.org/IATA/EDIST/2017.2">   <soapenv:Header/>   <soapenv:Body>      <ns2:OrderReshopRQ Version="IATA2017.2" xsi:schemaLocation="xmldsig-core-schema.xsd" xmlns:ns2="http://www.iata.org/IATA/EDIST/2017.2" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">         <ns2:Document>            <ns2:Name>PC NDC GATEWAY</ns2:Name>            <ns2:ReferenceVersion>1.0</ns2:ReferenceVersion>         </ns2:Document>         <ns2:Party>            <ns2:Sender>               <ns2:TravelAgencySender>                  <ns2:Contacts>                     <ns2:Contact>                        <ns2:EmailContact>                           <ns2:Address>IATI</ns2:Address>                        </ns2:EmailContact>                     </ns2:Contact>                  </ns2:Contacts>                  <ns2:AgencyID>IATI</ns2:AgencyID>                  <ns2:AgentUser>                     <ns2:Name>IATI</ns2:Name>                     <ns2:AgentUserID>T621OC48</ns2:AgentUserID>                     <ns2:UserRole>ADMIN</ns2:UserRole>                  </ns2:AgentUser>               </ns2:TravelAgencySender>            </ns2:Sender>         </ns2:Party>         <ns2:ReshopParameters>            <ns2:CurrCodes>               <ns2:CurrCode>TRY</ns2:CurrCode>            </ns2:CurrCodes>         </ns2:ReshopParameters>         <ns2:Query>            <ns2:OrderID>replaceOrderID</ns2:OrderID>             <ns2:Reshop>               <ns2:OrderServicing>                                 <ns2:Delete>                                       <ns2:OrderItem OrderItemID="replaceSegmentId1"/>         <ns2:OrderItem OrderItemID="replaceSegmentId2"/>          </ns2:Delete>              </ns2:OrderServicing>            </ns2:Reshop>            <ns2:Reprice>            <ns2:OrderItemID>replaceNewOfferId</ns2:OrderItemID>            </ns2:Reprice>         </ns2:Query>      </ns2:OrderReshopRQ>   </soapenv:Body></soapenv:Envelope>