src/main/resources/doXbagAvailabilityPnr.text

<?xml version="1.0"?> <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.iata.org/IATA/EDIST/2017.2"><soapenv:Header/><soapenv:Body><ns:ServiceListRQ Version="IATA2017.2"><ns:Document><ns:Name>PC NDC GATEWAY</ns:Name><ns:ReferenceVersion>1.0</ns:ReferenceVersion></ns:Document><ns:Party><ns:Sender><ns:TravelAgencySender><ns:Contacts><ns:Contact><ns:EmailContact><ns:Address>IATI</ns:Address></ns:EmailContact></ns:Contact></ns:Contacts><ns:AgencyID>IATI</ns:AgencyID><ns:AgentUser><ns:Name>IATI</ns:Name><ns:AgentUserID>T621OC48</ns:AgentUserID><ns:UserRole>ADMIN</ns:UserRole></ns:AgentUser></ns:TravelAgencySender></ns:Sender></ns:Party><ns:Parameters><ns:Languages><ns:LanguageCode>TR</ns:LanguageCode></ns:Languages><ns:CurrCodes><ns:FiledInCurrency><ns:CurrCode>TRY</ns:CurrCode></ns:FiledInCurrency></ns:CurrCodes></ns:Parameters><ns:Query><ns:OriginDestination><ns:Flight><ns:SegmentKey>replaceSegmentKey</ns:SegmentKey><ns:Departure><ns:AirportCode>ESB</ns:AirportCode><ns:Date>2018-11-12+03:00</ns:Date></ns:Departure><ns:Arrival><ns:AirportCode>SAW</ns:AirportCode></ns:Arrival><ns:MarketingCarrier><ns:AirlineID>PC</ns:AirlineID><ns:FlightNumber>2665</ns:FlightNumber></ns:MarketingCarrier></ns:Flight></ns:OriginDestination><ns:OrderID>replaceOrderId</ns:OrderID></ns:Query><ns:DataLists><ns:PassengerList><ns:Passenger PassengerID="replacePassengerID"><ns:PTC>ADT</ns:PTC><ns:ResidenceCountryCode>TR</ns:ResidenceCountryCode><ns:Individual><ns:GivenName>CSSQK</ns:GivenName><ns:Surname>CSLZJ</ns:Surname></ns:Individual></ns:Passenger></ns:PassengerList></ns:DataLists></ns:ServiceListRQ></soapenv:Body></soapenv:Envelope>
